## Pandas - Operations

In [87]:
import pandas as pd

In [88]:
df = pd.DataFrame({
    'col1': [1,2,3,4],
    'col2': [444,555,666,444],
    'col3': ['aaa', 'bbb', 'ccc', 'bbb']
})
df

   col1  col2 col3
0     1   444  aaa
1     2   555  bbb
2     3   666  ccc
3     4   444  bbb

In [89]:
df.head()

   col1  col2 col3
0     1   444  aaa
1     2   555  bbb
2     3   666  ccc
3     4   444  bbb

In [90]:
df['col1'].unique()

array([1, 2, 3, 4], dtype=int64)

In [91]:
df['col1'].nunique()

4

In [92]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [93]:
df[df['col2'] > 444]

   col1  col2 col3
1     2   555  bbb
2     3   666  ccc

### Apply custom function to the values in data frame

In [94]:
def square(num):
    return num ** 2

df['col1'].apply(square)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [95]:
df['col1'].apply(lambda x: x**2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [96]:
df.drop('col1', axis=1) # drop column

   col2 col3
0   444  aaa
1   555  bbb
2   666  ccc
3   444  bbb

In [97]:
df.drop(1) # drop row

   col1  col2 col3
0     1   444  aaa
2     3   666  ccc
3     4   444  bbb

In [98]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [99]:
df.index

RangeIndex(start=0, stop=4, step=1)

### Sorting

In [100]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  aaa
3     4   444  bbb
1     2   555  bbb
2     3   666  ccc

In [101]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

### Pivot Table

In [102]:
data = {
    'A': ['foo','foo','foo','bar','bar','bar'],
    'B': ['one', 'one', 'two', 'two', 'one', 'one'],
    'C': ['x','y','x','y','x','y'],
    'D': [1,3,2,5,4,1]
}

In [106]:
df = pd.DataFrame(data)

In [107]:
df.pivot_table(values='D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN